
&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	Текданные = ТекущиеДанные();
	Если Текданные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Текданные.Сумма = Текданные.Количество * Текданные.Цена;
	ОбновитьОбщуюСуммуПоДокументу();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОбщуюСуммуПоДокументу()
	Объект.СуммаПоДокументу = Объект.СписокНоменклатуры.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)
	Текданные = ТекущиеДанные();
	Если Текданные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Текданные.Сумма = Текданные.Количество * Текданные.Цена;
КонецПроцедуры


&НаКлиенте
Функция ТекущиеДанные()
	Возврат Элементы.СписокНоменклатуры.ТекущиеДанные;
КонецФункции
